articles/c-rust-ffi/c-rust-ffi.org
#+AUTHOR: Romeu Vieira

#+OPTIONS: html-style:nil
#+OPTIONS: html-scripts:nil

#+OPTIONS: author:nil
#+OPTIONS: email:nil
#+OPTIONS: date:nil
#+OPTIONS: toc:nil

#+PROPERTY: header-args :eval no

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/style.css"/>

#+HTML_HEAD: <meta name="theme-color" content="#7c6f64" />

#+TITLE: C to Rust FFI
#+DATE: 20-03-2022
#+EXPORT_FILE_NAME: c-rust-ffi

#+BEGIN_EXPORT html
<p class="spacing-64" \>
#+END_EXPORT

#+TOC: headlines 2

#+BEGIN_EXPORT html
<p class="spacing-64" \>
#+END_EXPORT

* Motivation

  Recently I wanted to develop a small program to write raw bytes directly do a USB device
  file, like =/dev/sdg=, by providing its =vendorid= and =productid= and then ask for
  write confirmation. The reason for this is that it is very risky to just use =dd= by
  checking the device file through =lsblk= or a similar program. Plugging the USB device
  in and out might change the device it points to.

  I wanted to use my programming language of choice: Rust. At the same time, I had to use
  =udev= library to access the information regarding the connected USB devices. I did find
  a [[https://crates.io/crates/udev][Rust crate]] that works as a wrapper and had
  everything I needed, but I thought that this could be an opportunity to actually learn
  something about FFI (Foreign Function Interface).

