articles/c-rust-ffi/c-rust-ffi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C to Rust FFI</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css"/>
<meta name="theme-color" content="#7c6f64" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">C to Rust FFI</h1>
<p class="spacing-64" \>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb6971b5">Motivation</a></li>
<li><a href="#orgbc1ca38">How To</a></li>
<li><a href="#org8cffab6">Usage</a></li>
<li><a href="#org082953f">Bonus</a></li>
</ul>
</div>
</div>

<p class="spacing-64" \>

<div id="outline-container-orgb6971b5" class="outline-2">
<h2 id="orgb6971b5">Motivation</h2>
<div class="outline-text-2" id="text-orgb6971b5">
<p>
Recently I wanted to develop a small program to write raw bytes directly do a USB device
file, like <code>/dev/sdg</code>, by providing its <code>vendorid</code> and <code>productid</code> and then ask for
write confirmation. The reason for this is that it is very risky to just use <code>dd</code> by
checking the device file through <code>lsblk</code> or a similar program. Plugging the USB device
in and out might change the device it points to.
</p>

<p>
I wanted to use my programming language of choice: Rust. At the same time, I had to use
<code>udev</code> library to access the information regarding the connected USB devices. I did find
a <a href="https://crates.io/crates/udev">Rust crate</a> that works as a wrapper and had
everything I needed, but I thought that this could be an opportunity to actually learn
something about FFI (Foreign Function Interface).
</p>
</div>
</div>
