articles/c-rust-ffi/c-rust-ffi.org
* How To

  I found a great [[https://rust-lang.github.io/rust-bindgen/introduction.html][Rust book]]
  called =The `bindgen` User Guide= and it had a great tutorial on how to start with FFI in
  Rust.
  So, after starting a new project, I immediately added =bindgen= library to =Cargo.toml=:

  #+BEGIN_SRC yaml
[build-dependencies]
bindgen = "0.59.2"
cc = { version = "1.0", features = ["parallel"] }
  #+END_SRC

  I created a C header file named =wrapper.h= in the =src= folder:

  #+BEGIN_SRC c
#include <libudev.h>
  #+END_SRC

  Alongside, I also created a =build.rs= build file in the root directory of the project:

  #+BEGIN_SRC rust
use std::env;
use std::path::PathBuf;

fn main() {

    // udev lib linkage
    println!("cargo:rustc-link-lib=udev");

    println!("cargo:rustc-link-search=.");

    // compile again if changes made to header
    println!("cargo:rerun-if-changed=src/wrapper.h");

    let bindings = bindgen::Builder::default()
        .header("src/wrapper.h")
        .parse_callbacks(Box::new(bindgen::CargoCallbacks))
        .generate()
        .expect("Unable to generate bindings");

    let out_path = PathBuf::from(env::var("OUT_DIR").unwrap());
    bindings
        .write_to_file(out_path.join("bindings.rs"))
        .expect("Couldn't write to bindings!");
}
  #+END_SRC

  The code above run when using the =cargo build= command, and it will re-run if the
  =wrapper.h= suffers any changes. It will generate a =bindings.rs= file in the build path
  (e.g.: =./target/debug/build/write-to-device-89d0f8bcd824fd52/out/bindings.rs=). This file
  contains everything related to whatever is included in the header file. In this case, it
  will convert every relevant =udev= code to Rust. The generated code respects the arguments
  and their type, so pointers and the use of =unsafe= scope are inevitable. Structures
  respect the C contract and implement the =Debug=, =Copy= and =Clone= traits. Here is a
  sample:

  #+BEGIN_SRC rust
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_device {
    _unused: [u8; 0],
}

extern "C" {
    pub fn udev_device_ref(udev_device: *mut udev_device) -> *mut udev_device;
    pub fn udev_device_unref(udev_device: *mut udev_device) -> *mut udev_device;
    pub fn udev_device_get_udev(udev_device: *mut udev_device) -> *mut udev;

    pub fn udev_device_new_from_syspath(
        udev: *mut udev,
        syspath: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;

    pub fn udev_device_new_from_devnum(
        udev: *mut udev,
        type_: ::std::os::raw::c_char,
        devnum: dev_t,
    ) -> *mut udev_device;
}
  #+END_SRC

  Lastly, I just included the bindings file at the top of the main project file so I can
  use everything declared in it:

  #+BEGIN_SRC rust
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]
#![allow(improper_ctypes)]

// include the bindings
include!(concat!(env!("OUT_DIR"), "/bindings.rs"));
  #+END_SRC

  The project is now ready and now I can use every function and structure from the =udev=
  library! But there is still something that hasn't been covered: you can have your own C
  source file with your own functions and use it. For instance, you can declare new structs
  in your header file. In the following code from =wrapper.h=, I added a struct called
  =DeviceInfo=, which now can be used directly through the Rust code:

  #+BEGIN_SRC c
#include <libudev.h>

struct DeviceInfo {
    struct udev* udev;
    struct udev_device* block;
    struct udev_device* scsi;
    struct udev_device* usb;
};
  #+END_SRC

  New functions can also be added to the header file and the process is similar. In case a
  user wants to have the functions implemented in a C file, lets say =src/libdevice.c=, the
  =build.rs= needs to be changed so a static library can be generated through the C file and
  then integrated into the final binary:

  #+BEGIN_SRC rust
use std::env;
use std::path::PathBuf;

fn main() {

    cc::Build::new().file("src/libdevice.c").compile("libdevice.a");

    // udev lib linkage
    println!("cargo:rustc-link-lib=udev");

    println!("cargo:rustc-link-search=.");

    // compile again if changes made to header
    println!("cargo:rerun-if-changed=src/wrapper.h");

    let bindings = bindgen::Builder::default()
        .header("src/wrapper.h")
        .parse_callbacks(Box::new(bindgen::CargoCallbacks))
        .generate()
        .expect("Unable to generate bindings");

    let out_path = PathBuf::from(env::var("OUT_DIR").unwrap());
    bindings
        .write_to_file(out_path.join("bindings.rs"))
        .expect("Couldn't write to bindings!");
}
  #+END_SRC

  To access the functions in Rust, you can declare the function prototypes in the header
  file and letting =bindgen= do all the work. Or, if you wish to suffer from an headache,
  you can declare them manually in the Rust source code after including the bindings:

  #+BEGIN_SRC rust
extern "C" {
    pub fn get_child(
        udev: *mut udev,
        parent: *mut udev_device,
        subsystem: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;

    pub fn enumerate_usb_mass_storage(udev: *mut udev);

    pub fn get_device_info_by_block(device_path: *const c_char) -> *mut DeviceInfo;
    pub fn get_device_info_by_vp(
        id_vendor: *const c_char,
        id_product: *const c_char,
    ) -> *mut DeviceInfo;
}
  #+END_SRC

