articles/c-rust-ffi/c-rust-ffi.html

<div id="outline-container-orgbc1ca38" class="outline-2">
<h2 id="orgbc1ca38">How To</h2>
<div class="outline-text-2" id="text-orgbc1ca38">
<p>
I found a great <a href="https://rust-lang.github.io/rust-bindgen/introduction.html">Rust book</a>
called <code>The `bindgen` User Guide</code> and it had a great tutorial on how to start with FFI in
Rust.
So, after starting a new project, I immediately added <code>bindgen</code> library to <code>Cargo.toml</code>:
</p>

<div class="org-src-container">
<pre class="src src-yaml">[build-dependencies]
bindgen = "0.59.2"
cc = { version = "1.0", features = ["parallel"] }
</pre>
</div>

<p>
I created a C header file named <code>wrapper.h</code> in the <code>src</code> folder:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;libudev.h&gt;</span>
</pre>
</div>

<p>
Alongside, I also created a <code>build.rs</code> build file in the root directory of the project:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">use</span> <span class="org-constant">std</span>::env;
<span class="org-keyword">use</span> <span class="org-constant">std</span>::<span class="org-constant">path</span>::<span class="org-type">PathBuf</span>;

<span class="org-keyword">fn</span> <span class="org-function-name">main</span>() {

    <span class="org-comment-delimiter">// </span><span class="org-comment">udev lib linkage</span>
    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rustc-link-lib=udev"</span>);

    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rustc-link-search=."</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">compile again if changes made to header</span>
    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rerun-if-changed=src/wrapper.h"</span>);

    <span class="org-keyword">let</span> <span class="org-variable-name">bindings</span> = <span class="org-constant">bindgen</span>::<span class="org-type">Builder</span>::default()
        .header(<span class="org-string">"src/wrapper.h"</span>)
        .parse_callbacks(<span class="org-type">Box</span>::new(<span class="org-constant">bindgen</span>::<span class="org-type">CargoCallbacks</span>))
        .generate()
        .expect(<span class="org-string">"Unable to generate bindings"</span>);

    <span class="org-keyword">let</span> <span class="org-variable-name">out_path</span> = <span class="org-type">PathBuf</span>::from(<span class="org-constant">env</span>::var(<span class="org-string">"OUT_DIR"</span>).unwrap());
    bindings
        .write_to_file(out_path.join(<span class="org-string">"bindings.rs"</span>))
        .expect(<span class="org-string">"Couldn't write to bindings!"</span>);
}
</pre>
</div>

<p>
The code above run when using the <code>cargo build</code> command, and it will re-run if the
<code>wrapper.h</code> suffers any changes. It will generate a <code>bindings.rs</code> file in the build path
(e.g.: <code>./target/debug/build/write-to-device-89d0f8bcd824fd52/out/bindings.rs</code>). This file
contains everything related to whatever is included in the header file. In this case, it
will convert every relevant <code>udev</code> code to Rust. The generated code respects the arguments
and their type, so pointers and the use of <code>unsafe</code> scope are inevitable. Structures
respect the C contract and implement the <code>Debug</code>, <code>Copy</code> and <code>Clone</code> traits. Here is a
sample:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[repr(C)]</span>
<span class="org-preprocessor">#[derive(Debug, Copy, Clone)]</span>
<span class="org-keyword">pub</span> <span class="org-keyword">struct</span> <span class="org-type">udev_device</span> {
    <span class="org-variable-name">_unused</span>: [<span class="org-type">u8</span>; 0],
}

<span class="org-keyword">extern</span> <span class="org-string">"C"</span> {
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">udev_device_ref</span>(<span class="org-variable-name">udev_device</span>: *<span class="org-keyword">mut</span> udev_device) -&gt; *<span class="org-keyword">mut</span> udev_device;
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">udev_device_unref</span>(<span class="org-variable-name">udev_device</span>: *<span class="org-keyword">mut</span> udev_device) -&gt; *<span class="org-keyword">mut</span> udev_device;
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">udev_device_get_udev</span>(<span class="org-variable-name">udev_device</span>: *<span class="org-keyword">mut</span> udev_device) -&gt; *<span class="org-keyword">mut</span> udev;

    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">udev_device_new_from_syspath</span>(
        <span class="org-variable-name">udev</span>: *<span class="org-keyword">mut</span> udev,
        <span class="org-variable-name">syspath</span>: *<span class="org-keyword">const</span> ::<span class="org-constant">std</span>::<span class="org-constant">os</span>::<span class="org-constant">raw</span>::c_char,
    ) -&gt; *<span class="org-keyword">mut</span> udev_device;

    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">udev_device_new_from_devnum</span>(
        <span class="org-variable-name">udev</span>: *<span class="org-keyword">mut</span> udev,
        <span class="org-variable-name">type_</span>: ::<span class="org-constant">std</span>::<span class="org-constant">os</span>::<span class="org-constant">raw</span>::c_char,
        <span class="org-variable-name">devnum</span>: dev_t,
    ) -&gt; *<span class="org-keyword">mut</span> udev_device;
}
</pre>
</div>

<p>
Lastly, I just included the bindings file at the top of the main project file so I can
use everything declared in it:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#![allow(non_upper_case_globals)]</span>
<span class="org-preprocessor">#![allow(non_camel_case_types)]</span>
<span class="org-preprocessor">#![allow(non_snake_case)]</span>
<span class="org-preprocessor">#![allow(dead_code)]</span>
<span class="org-preprocessor">#![allow(improper_ctypes)]</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">include the bindings</span>
<span class="org-preprocessor">include!</span>(<span class="org-preprocessor">concat!</span>(<span class="org-preprocessor">env!</span>(<span class="org-string">"OUT_DIR"</span>), <span class="org-string">"/bindings.rs"</span>));
</pre>
</div>

<p>
The project is now ready and now I can use every function and structure from the <code>udev</code>
library! But there is still something that hasn't been covered: you can have your own C
source file with your own functions and use it. For instance, you can declare new structs
in your header file. In the following code from <code>wrapper.h</code>, I added a struct called
<code>DeviceInfo</code>, which now can be used directly through the Rust code:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;libudev.h&gt;</span>

<span class="org-keyword">struct</span> <span class="org-type">DeviceInfo</span> {
    <span class="org-keyword">struct</span> <span class="org-type">udev</span>* <span class="org-variable-name">udev</span>;
    <span class="org-keyword">struct</span> <span class="org-type">udev_device</span>* <span class="org-variable-name">block</span>;
    <span class="org-keyword">struct</span> <span class="org-type">udev_device</span>* <span class="org-variable-name">scsi</span>;
    <span class="org-keyword">struct</span> <span class="org-type">udev_device</span>* <span class="org-variable-name">usb</span>;
};
</pre>
</div>

<p>
New functions can also be added to the header file and the process is similar. In case a
user wants to have the functions implemented in a C file, lets say <code>src/libdevice.c</code>, the
<code>build.rs</code> needs to be changed so a static library can be generated through the C file and
then integrated into the final binary:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">use</span> <span class="org-constant">std</span>::env;
<span class="org-keyword">use</span> <span class="org-constant">std</span>::<span class="org-constant">path</span>::<span class="org-type">PathBuf</span>;

<span class="org-keyword">fn</span> <span class="org-function-name">main</span>() {

    <span class="org-constant">cc</span>::<span class="org-type">Build</span>::new().file(<span class="org-string">"src/libdevice.c"</span>).compile(<span class="org-string">"libdevice.a"</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">udev lib linkage</span>
    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rustc-link-lib=udev"</span>);

    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rustc-link-search=."</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">compile again if changes made to header</span>
    <span class="org-rust-builtin-formatting-macro">println!</span>(<span class="org-string">"cargo:rerun-if-changed=src/wrapper.h"</span>);

    <span class="org-keyword">let</span> <span class="org-variable-name">bindings</span> = <span class="org-constant">bindgen</span>::<span class="org-type">Builder</span>::default()
        .header(<span class="org-string">"src/wrapper.h"</span>)
        .parse_callbacks(<span class="org-type">Box</span>::new(<span class="org-constant">bindgen</span>::<span class="org-type">CargoCallbacks</span>))
        .generate()
        .expect(<span class="org-string">"Unable to generate bindings"</span>);

    <span class="org-keyword">let</span> <span class="org-variable-name">out_path</span> = <span class="org-type">PathBuf</span>::from(<span class="org-constant">env</span>::var(<span class="org-string">"OUT_DIR"</span>).unwrap());
    bindings
        .write_to_file(out_path.join(<span class="org-string">"bindings.rs"</span>))
        .expect(<span class="org-string">"Couldn't write to bindings!"</span>);
}
</pre>
</div>

<p>
To access the functions in Rust, you can declare the function prototypes in the header
file and letting <code>bindgen</code> do all the work. Or, if you wish to suffer from an headache,
you can declare them manually in the Rust source code after including the bindings:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">extern</span> <span class="org-string">"C"</span> {
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">get_child</span>(
        <span class="org-variable-name">udev</span>: *<span class="org-keyword">mut</span> udev,
        <span class="org-variable-name">parent</span>: *<span class="org-keyword">mut</span> udev_device,
        <span class="org-variable-name">subsystem</span>: *<span class="org-keyword">const</span> ::<span class="org-constant">std</span>::<span class="org-constant">os</span>::<span class="org-constant">raw</span>::c_char,
    ) -&gt; *<span class="org-keyword">mut</span> udev_device;

    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">enumerate_usb_mass_storage</span>(<span class="org-variable-name">udev</span>: *<span class="org-keyword">mut</span> udev);

    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">get_device_info_by_block</span>(<span class="org-variable-name">device_path</span>: *<span class="org-keyword">const</span> c_char) -&gt; *<span class="org-keyword">mut</span> <span class="org-type">DeviceInfo</span>;
    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">get_device_info_by_vp</span>(
        <span class="org-variable-name">id_vendor</span>: *<span class="org-keyword">const</span> c_char,
        <span class="org-variable-name">id_product</span>: *<span class="org-keyword">const</span> c_char,
    ) -&gt; *<span class="org-keyword">mut</span> <span class="org-type">DeviceInfo</span>;
}
</pre>
</div>
</div>
</div>
