articles/c-rust-ffi/c-rust-ffi.org
* Usage

  Using the functions generated by =bindgen= is different and arguably more annoying
  because we are now dealing directly with pointers and specific C types so it is up to
  the user if there is need to wrap the functions or structures into safer types, with the
  goal of centralizing the usage of =unsafe= scopes. Rust already helps us because we have
  access to the C types, we can verify if a pointer is null or not through =is_null()= and
  we can convert Rust types into C-specific types that are friendlier when using the
  bindings. As an example, when a binding need a =char*=, we can use a =CString= and pass
  it as a pointer. We can also convert a Rust =&str= into a =CString=.

  As mentioned above, a structure called =DeviceInfo= was declared in the header file and
  is being returned as a pointer in a C function. It is also important to understand that
  there is memory being allocated for the structure, so there is the need to free it
  later. With this in mind, we can implement new methods for the structure without
  touching the C code, so it is possible to create functions to instantiate the structure,
  free the structure, etc. In my case, I created a =new= function, that creates a
  =DeviceInfo= object, a =get_device_node= function, that wraps the C function, and a
  drop= function with the purpose of cleaning the memory (because =Drop= trait doesn't
  work alongside =Copy= trait).

  In the example below, I was able to create a safe version of =DeviceInfo= through the
  =new= function. I get the object as a pointer, copy its contents to a new variable, then
  I free the pointer and return the variable that holds the copy. This way, no memory
  leaks related to the structure and now I have an instance of a =DeviceInfo= that I can
  use without writing =unsafe= in every line of code. Wrapping the
  =udev_device_get_devnode= function is also great for additional error checks and, once
  again, not having the need of writing the same keyword many times. The same for =drop=.

  #+BEGIN_SRC rust
impl DeviceInfo {
    fn new(id_vendor: &str, id_product: &str) -> Result<DeviceInfo> {
        let id_vendor_cs = CString::new(id_vendor).map_err(Error::CStringInit)?;
        let id_product_cs = CString::new(id_product).map_err(Error::CStringInit)?;
        let device_info =
            unsafe { get_device_info_by_vp(id_vendor_cs.as_ptr(), id_product_cs.as_ptr()) };

        if device_info.is_null() {
            Err(Error::Block("devnode is null"))
        } else {
            let deref = unsafe { *device_info };

            // free original copy
            unsafe { libc::free(device_info as *mut _ as *mut libc::c_void) };

            Ok(deref)
        }
    }

    fn get_device_node(&self) -> Result<String> {
        if self.block.is_null() {
            return Err(Error::Block("block is null"));
        }

        let devnode = unsafe { udev_device_get_devnode(self.block) };

        if devnode.is_null() {
            return Err(Error::Block("devnode is null"));
        }

        Ok(cchar_to_string(devnode as *const c_char))
    }

    fn drop(&mut self) {
        if !self.block.is_null() {
            unsafe {
                udev_device_unref(self.block);
            };
        }

        if !self.scsi.is_null() {
            unsafe {
                udev_device_unref(self.scsi);
            };
        }

        if !self.udev.is_null() {
            unsafe {
                udev_unref(self.udev);
            };
        }
    }
}
  #+END_SRC

  All the code from this article can be found [[https://github.com/RomeuG/write-to-usb][here]].

