articles/c-rust-ffi/c-rust-ffi.html

<div id="outline-container-org8cffab6" class="outline-2">
<h2 id="org8cffab6">Usage</h2>
<div class="outline-text-2" id="text-org8cffab6">
<p>
Using the functions generated by <code>bindgen</code> is different and arguably more annoying
because we are now dealing directly with pointers and specific C types so it is up to
the user if there is need to wrap the functions or structures into safer types, with the
goal of centralizing the usage of <code>unsafe</code> scopes. Rust already helps us because we have
access to the C types, we can verify if a pointer is null or not through <code>is_null()</code> and
we can convert Rust types into C-specific types that are friendlier when using the
bindings. As an example, when a binding need a <code>char*</code>, we can use a <code>CString</code> and pass
it as a pointer. We can also convert a Rust <code>&amp;str</code> into a <code>CString</code>.
</p>

<p>
As mentioned above, a structure called <code>DeviceInfo</code> was declared in the header file and
is being returned as a pointer in a C function. It is also important to understand that
there is memory being allocated for the structure, so there is the need to free it
later. With this in mind, we can implement new methods for the structure without
touching the C code, so it is possible to create functions to instantiate the structure,
free the structure, etc. In my case, I created a <code>new</code> function, that creates a
<code>DeviceInfo</code> object, a <code>get_device_node</code> function, that wraps the C function, and a
drop= function with the purpose of cleaning the memory (because <code>Drop</code> trait doesn't
work alongside <code>Copy</code> trait).
</p>

<p>
In the example below, I was able to create a safe version of <code>DeviceInfo</code> through the
<code>new</code> function. I get the object as a pointer, copy its contents to a new variable, then
I free the pointer and return the variable that holds the copy. This way, no memory
leaks related to the structure and now I have an instance of a <code>DeviceInfo</code> that I can
use without writing <code>unsafe</code> in every line of code. Wrapping the
<code>udev_device_get_devnode</code> function is also great for additional error checks and, once
again, not having the need of writing the same keyword many times. The same for <code>drop</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">impl</span> <span class="org-type">DeviceInfo</span> {
    <span class="org-keyword">fn</span> <span class="org-function-name">new</span>(<span class="org-variable-name">id_vendor</span>: &amp;<span class="org-type">str</span>, <span class="org-variable-name">id_product</span>: &amp;<span class="org-type">str</span>) -&gt; <span class="org-type">Result</span>&lt;<span class="org-type">DeviceInfo</span>&gt; {
        <span class="org-keyword">let</span> <span class="org-variable-name">id_vendor_cs</span> = <span class="org-type">CString</span>::new(id_vendor).map_err(<span class="org-type">Error</span>::<span class="org-type">CStringInit</span>)<span class="org-rust-question-mark">?</span>;
        <span class="org-keyword">let</span> <span class="org-variable-name">id_product_cs</span> = <span class="org-type">CString</span>::new(id_product).map_err(<span class="org-type">Error</span>::<span class="org-type">CStringInit</span>)<span class="org-rust-question-mark">?</span>;
        <span class="org-keyword">let</span> <span class="org-variable-name">device_info</span> =
            <span class="org-rust-unsafe">unsafe</span> { get_device_info_by_vp(id_vendor_cs.as_ptr(), id_product_cs.as_ptr()) };

        <span class="org-keyword">if</span> device_info.is_null() {
            <span class="org-type">Err</span>(<span class="org-type">Error</span>::<span class="org-type">Block</span>(<span class="org-string">"devnode is null"</span>))
        } <span class="org-keyword">else</span> {
            <span class="org-keyword">let</span> <span class="org-variable-name">deref</span> = <span class="org-rust-unsafe">unsafe</span> { *device_info };

            <span class="org-comment-delimiter">// </span><span class="org-comment">free original copy</span>
            <span class="org-rust-unsafe">unsafe</span> { <span class="org-constant">libc</span>::free(device_info <span class="org-keyword">as</span> *<span class="org-keyword">mut</span> _ <span class="org-keyword">as</span> *<span class="org-keyword">mut</span> <span class="org-constant">libc</span>::c_void) };

            <span class="org-type">Ok</span>(deref)
        }
    }

    <span class="org-keyword">fn</span> <span class="org-function-name">get_device_node</span>(&amp;<span class="org-keyword">self</span>) -&gt; <span class="org-type">Result</span>&lt;<span class="org-type">String</span>&gt; {
        <span class="org-keyword">if</span> <span class="org-keyword">self</span>.block.is_null() {
            <span class="org-keyword">return</span> <span class="org-type">Err</span>(<span class="org-type">Error</span>::<span class="org-type">Block</span>(<span class="org-string">"block is null"</span>));
        }

        <span class="org-keyword">let</span> <span class="org-variable-name">devnode</span> = <span class="org-rust-unsafe">unsafe</span> { udev_device_get_devnode(<span class="org-keyword">self</span>.block) };

        <span class="org-keyword">if</span> devnode.is_null() {
            <span class="org-keyword">return</span> <span class="org-type">Err</span>(<span class="org-type">Error</span>::<span class="org-type">Block</span>(<span class="org-string">"devnode is null"</span>));
        }

        <span class="org-type">Ok</span>(cchar_to_string(devnode <span class="org-keyword">as</span> *<span class="org-keyword">const</span> c_char))
    }

    <span class="org-keyword">fn</span> <span class="org-function-name">drop</span>(&amp;<span class="org-keyword">mut</span> <span class="org-keyword">self</span>) {
        <span class="org-keyword">if</span> !<span class="org-keyword">self</span>.block.is_null() {
            <span class="org-rust-unsafe">unsafe</span> {
                udev_device_unref(<span class="org-keyword">self</span>.block);
            };
        }

        <span class="org-keyword">if</span> !<span class="org-keyword">self</span>.scsi.is_null() {
            <span class="org-rust-unsafe">unsafe</span> {
                udev_device_unref(<span class="org-keyword">self</span>.scsi);
            };
        }

        <span class="org-keyword">if</span> !<span class="org-keyword">self</span>.udev.is_null() {
            <span class="org-rust-unsafe">unsafe</span> {
                udev_unref(<span class="org-keyword">self</span>.udev);
            };
        }
    }
}
</pre>
</div>

<p>
All the code from this article can be found <a href="https://github.com/RomeuG/write-to-usb">here</a>.
</p>
</div>
</div>
