articles/c-rust-ffi/c-rust-ffi.org
* Bonus

  In this bonus section, I will show a simple example on how to do the reverse: calling
  Rust code from C. I have a very simple Rust crate that has a function that adds two
  numbers. The goal is to use that same function from C. To start, we need to make sure
  that the function name is not mangled and it is declared wit the =extern= keyword:

  #+BEGIN_SRC rust
#[no_mangle]
pub extern "C" fn add(a: u32, b: u32) -> u32 {
    a + b
}
  #+END_SRC

  The next step is to tell =Cargo= that we want it to generate a shared library or a
  static library. The following has to be added to the =Cargo.toml= file of the crate and
  the =crate-type= should be defined according to the type of the result object file:

  #+BEGIN_SRC toml
[lib]
name = "sum"
crate-type = ["cdylib"] # creates dynamic lib
# crate-type = ["staticlib"] # creates static lib
  #+END_SRC

  When building the crate, it will automatically generate the library files. In this case,
  since the =crate-type= is =cdylib=, it will generate a shared object in
  =target/release/libsum.so=. To use this in the C code, we have to have a corresponding
  header file with the function prototypes. This is possible to do using a tool called
  [[https://github.com/eqrion/cbindgen][cbindgen]] and running it on the crate root
  directory. On the following command, I reference the crate name, the output header file
  name and the fact that I want it to output explicitly in C.

  #+BEGIN_SRC sh
$ cbindgen --crate sum --output sum.h --lang c
  #+END_SRC

  The generated header file:

  #+BEGIN_SRC c
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>

uint32_t add(uint32_t a, uint32_t b);
  #+END_SRC

  Both the shared object and the header file can now be used in a C project directly and
  compile it with the command =gcc main.c -lsum -L./rust-sum/target/release=:

  #+BEGIN_SRC c
#include "sum.h"
#include <assert.h>
#include <stdio.h>

int main() {
    uint32_t result = add(2, 2);
    assert(result == 4);

    printf("Result: %d\n", result);

    return 0;
}
  #+END_SRC

  Then, with the shared object in the same directory, run the executable:

  #+BEGIN_SRC sh
$ ./a.out
Result: 4
  #+END_SRC

* FOOTER                                                                                              :ignore:
:PROPERTIES:
:clearpage: t
:END:
#+BEGIN_EXPORT html
<hr>
<footer>
<div class="container">
<ul class="menu-list">
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/index.html" class="test">Home</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/articles/articles.html">Articles</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/writeups/htb/index.html">Write-Ups</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a class="inactive-link">20-03-2022</a>
</li>
</ul>
</div>
</footer>
#+END_EXPORT