articles/c-rust-ffi/c-rust-ffi.html

<div id="outline-container-org082953f" class="outline-2">
<h2 id="org082953f">Bonus</h2>
<div class="outline-text-2" id="text-org082953f">
<p>
In this bonus section, I will show a simple example on how to do the reverse: calling
Rust code from C. I have a very simple Rust crate that has a function that adds two
numbers. The goal is to use that same function from C. To start, we need to make sure
that the function name is not mangled and it is declared wit the <code>extern</code> keyword:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[no_mangle]</span>
<span class="org-keyword">pub</span> <span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">fn</span> <span class="org-function-name">add</span>(<span class="org-variable-name">a</span>: <span class="org-type">u32</span>, <span class="org-variable-name">b</span>: <span class="org-type">u32</span>) -&gt; <span class="org-type">u32</span> {
    a + b
}
</pre>
</div>

<p>
The next step is to tell <code>Cargo</code> that we want it to generate a shared library or a
static library. The following has to be added to the <code>Cargo.toml</code> file of the crate and
the <code>crate-type</code> should be defined according to the type of the result object file:
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span class="org-type">lib</span>]
<span class="org-variable-name">name</span> = <span class="org-string">"sum"</span>
<span class="org-variable-name">crate-type</span> = [<span class="org-string">"cdylib"</span>] <span class="org-comment-delimiter"># </span><span class="org-comment">creates dynamic lib</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">crate-type = ["staticlib"] # creates static lib</span>
</pre>
</div>

<p>
When building the crate, it will automatically generate the library files. In this case,
since the <code>crate-type</code> is <code>cdylib</code>, it will generate a shared object in
<code>target/release/libsum.so</code>. To use this in the C code, we have to have a corresponding
header file with the function prototypes. This is possible to do using a tool called
<a href="https://github.com/eqrion/cbindgen">cbindgen</a> and running it on the crate root
directory. On the following command, I reference the crate name, the output header file
name and the fact that I want it to output explicitly in C.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cbindgen --crate sum --output sum.h --lang c
</pre>
</div>

<p>
The generated header file:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdarg.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdbool.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdint.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdlib.h&gt;</span>

<span class="org-type">uint32_t</span> <span class="org-function-name">add</span>(<span class="org-type">uint32_t</span> <span class="org-variable-name">a</span>, <span class="org-type">uint32_t</span> <span class="org-variable-name">b</span>);
</pre>
</div>

<p>
Both the shared object and the header file can now be used in a C project directly and
compile it with the command <code>gcc main.c -lsum -L./rust-sum/target/release</code>:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">"sum.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;assert.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-type">uint32_t</span> <span class="org-variable-name">result</span> = add(2, 2);
    assert(result == 4);

    printf(<span class="org-string">"Result: %d\n"</span>, result);

    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
Then, with the shared object in the same directory, run the executable:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ./a.out
Result: 4
</pre>
</div>
</div>
</div>

<hr>
<footer>
<div class="container">
<ul class="menu-list-wide">
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/index.html" class="test">Home</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/articles">Articles</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a href="/writeups/htb/index.html">Write-Ups</a>
</li>
<li class="menu-list-item flex-basis-100-margin fit-content">
<a class="inactive-link">20-03-2022</a>
</li>
</ul>
</div>
</footer>
</div>
</body>
</html>
